## Actividad 1

### Lectura y análisis exploratorio de datos

In [2]:
import pandas as pd

In [4]:
def thingToNum(value):
    num = 0
    digitos = set(['1','2','3','4','5','6','7','8','9','0'])
    for i in value:
        if i == '.':
            return num
        elif i in digitos:
            num = num * 10 + int(i)
    return num

In [5]:
df = pd.read_csv("datos/ejemplo_data.csv")
df.dtypes

ID              int64
Nombre         object
2016           object
2017           object
Crecimiento    object
Unidades       object
fecha          object
Activo          int64
dtype: object

In [6]:
df = df.astype({'ID':'int', 'Activo':'bool'})
df.dtypes

ID              int32
Nombre         object
2016           object
2017           object
Crecimiento    object
Unidades       object
fecha          object
Activo           bool
dtype: object

In [7]:
df['Unidades'] = df['Unidades'].apply(thingToNum)
df['2016'] = df['2016'].apply(thingToNum)
df = df.astype({'Unidades':'int', '2016':'float'})
df.dtypes

ID               int32
Nombre          object
2016           float64
2017            object
Crecimiento     object
Unidades         int32
fecha           object
Activo            bool
dtype: object

In [8]:
df

,ID,Nombre,2016,2017,Crecimiento,Unidades,fecha,Activo
0,10002,Verde Mar,125000.0,$162500.00,30.00%,500,1-10-2015,True
1,552278,Manantial sa,920000.0,"$101,2000.00",10.00%,700,6-23-2014,False
2,23477,ACME,50000.0,62500.00,25.00%,125,3-12-2016,True
3,24900,Andes sur,350000.0,490000.00,4.00%,75,10-28-2015,True
4,651029,San Pablo,15000.0,$12750.00,-15.00%,0,2-15-2014,False

### Lectura y análisis exploratorio de datos 2

In [9]:
df2 = pd.read_csv("datos/ecommerce_data.csv", parse_dates = [4], date_format = "%d/%m/%y %H:%M", encoding = 'unicode_escape')
df2.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

In [10]:
df2['InvoiceNo'] = df2['InvoiceNo'].apply(thingToNum)
df2 = df2.astype({'InvoiceNo':'int', 'Description':'str'})
df2.dtypes

InvoiceNo        int32
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

In [11]:
df2 = df2.astype({'Quantity':'int', 'UnitPrice':'float'})
df2.dtypes

InvoiceNo        int32
StockCode       object
Description     object
Quantity         int32
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

In [ ]:
df2[['Date', 'Time']] = df2['InvoiceDate'].str.split(' ', expand=True)
del df2['InvoiceDate']
df2['Price'] = df2['Quantity'] * df2['UnitPrice']
df

In [ ]:
df2.to_csv('new_ecommerce_data.csv', index=False)

In [ ]:
# Exploracion de otras funciones

### Estadísticas Descriptivas

In [12]:
import random

In [20]:
people = {'ID': [], 'Age': [], 'Height': [], 'Grade': []}

for i in range(50):

    n = [random.randint(65,90) for _ in range(4)]

    id = chr(n[0])
    for l in random.choices(range(10), k = 6):
        id += str(l)

    people['ID'].append(id)
    people['Age'].append(n[1]-47)
    people['Height'].append(1+n[2]/100)
    people['Grade'].append(99*(n[3]-65)/25+1)

people['Approved'] = ['YES' if grade >= 51 else 'NO' for grade in people['Grade']]

print(people.keys())

dict_keys(['ID', 'Age', 'Height', 'Grade', 'Approved'])

In [22]:
dfPeople = pd.DataFrame(people)
dfPeople.head()

        ID  Age  Height   Grade Approved
0  B331973   39    1.81  100.00      YES
1  U896640   25    1.66    8.92       NO
2  E261250   33    1.73   92.08      YES
3  V464169   38    1.69   64.36      YES
4  A273009   38    1.84   48.52       NO

In [23]:
dfPeople.describe()

             Age     Height      Grade
count  50.000000  50.000000   50.00000
mean   31.240000   1.768800   53.19280
std     7.852102   0.076228   31.24966
min    19.000000   1.650000    1.00000
25%    24.250000   1.712500   28.72000
50%    30.500000   1.775000   52.48000
75%    38.750000   1.817500   79.21000
max    43.000000   1.900000  100.00000

In [ ]:
print(dfPeople.var(numeric_only=True))      # Varianza
print(dfPeople.cov(numeric_only=True))      # Covarianza

Age        61.655510
Height      0.005811
Grade     976.541237
dtype: float64
              Age    Height       Grade
Age     61.655510 -0.090522   42.738906
Height  -0.090522  0.005811   -0.181772
Grade   42.738906 -0.181772  976.541237

### Transformación e imputación de datos

In [12]:
dfR = pd.read_csv("datos/ratings_data.csv")
del dfR[dfR.columns[0]]
dfR.head()

   User-ID        ISBN  Book-Rating  MeanRating
0   276725  034545104X            0    2.933333
1   276726  0155061224            5    2.500000
2   276727  0446520802            0    4.060345
3   276729  052165615X            3    3.000000
4   276729  0521795028            6    6.000000

In [16]:
dfR.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1149780 entries, 0 to 1149779
Data columns (total 4 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   User-ID      1149780 non-null  int64
 1   ISBN         1149780 non-null  object
 2   Book-Rating  1149780 non-null  int64
 3   MeanRating   1149780 non-null  float64
dtypes: float64(1), int64(2), object(1)
memory usage: 35.1+ MB

In [6]:
dfB = pd.read_csv("datos/books_data.csv", sep=';', encoding = 'unicode_escape', low_memory=False)
dfB.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton & Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [13]:
dfB.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271379 entries, 0 to 271378
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271379 non-null  object
 1   Book-Title           271379 non-null  object
 2   Book-Author          271377 non-null  object
 3   Year-Of-Publication  271379 non-null  object
 4   Publisher            271377 non-null  object
 5   Image-URL-S          271379 non-null  object
 6   Image-URL-M          271379 non-null  object
 7   Image-URL-L          271378 non-null  object
dtypes: object(8)
memory usage: 16.6+ MB